README updated
